benchmarks/results/scenario_D.txt
Running 30s test @ http://localhost:8000
  6 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.71ms   26.13ms 204.86ms   86.11%
    Req/Sec     1.58k   361.72     2.39k    66.22%
  283538 requests in 30.01s, 43.78MB read
  Non-2xx or 3xx responses: 14
Requests/sec:   9447.71
Transfer/sec:      1.46MB